import {Possibility} from '../interface/possibility';

// factor 抽取在当前层所占的比重
// type 取得最近的一层的type信息， 将会当成附件信息原样返回
// 每个级别分开抽取 类别（角色卡、材料等） =》　细节（物品等级）＝》　物品
export const equipmentSupplementPossibility: Possibility = {
  name: 'equipment supplement',
  factor: 999,
  possibility: [
    {
      name: '4星圣痕',
      factor: 8556,
      type: 'stigmata',
      contents: [
        '埃及艳后', '姬轩辕',
        '莎士比亚', '俄国沙皇', '李耳',
        '伏羲', '女娲', '神农',
        '牛顿', '薛定谔'
      ]
    },
    {
      name: '3星圣痕',
      factor: 32977,
      type: 'stigmata',
      contents: [
        '里纳耳多', '时雨绮罗', '奥吉尔',
        '大帝', '特斯拉', '坂本龙马',
        '阿提拉', '王昭君', '伊丽莎白',
        '汉娜',
        '奥托薇拉',
        '露西亚',
        '薇欧拉',
        '维多利亚'
      ]
    },
    {
      name: '4星武器',
      factor: 5704,
      type: 'weapon',
      contents: [
        '百手巨人初型', '圣遗物5th', '重装小兔19C',
        '核心聚能跑Delta', '尤弥尔之腕', '蚩尤巨炮',
        '量子毁灭者II型', '日炎大剑', '极光斩舰刀',
        '尼德霍格翼爪', '圣遗物2nd', '索尔之锤', '超电磁炮',
        '光与影', '烈焰毁灭者'
      ]
    },
    {
      name: '3星武器',
      factor: 10992,
      type: 'weapon',
      contents: [
        '水妖精I型', '火妖精I型', '水妖精II型', '火妖精II型', '苗刀·雷妖', '苗刀·电魂', '脉冲太刀17式', '脉冲太刀19式', '马尔夫科A', '马尔夫科C',
        '阴极子炮07式', '阴极子炮09式', '超重剑·冲锋', '电离共振剑', '氮素结晶剑', '超重剑·王蛇', '火天使', '雷天使',
        '黑色粉碎者', 'CAS-X圣徒', '白星驱逐者',
        '沙漠之鹰', '柯尔特巨蟒·改', 'm1911', 'usp改', '崛川国广', '妖刀村正', '妖刀雨村', '复合刀·柳叶', 'su30',
        'Mig-11', 'Mig-13', 'Mig-7激光炮', '能量大剑', '融核动力初型', '融核动力剑·改', '混种大剑27式', '十字架·冰弹', '火焰弹发射台', '破甲弹发射台', '冰霜之誓'

      ]
    },
    {
      name: '进化材料',
      factor: 16708,
      type: 'equipment',
      contents: [
        '超合金护盾', '断裂的刀柄',
        '超小型反应炉', '超合金反射镜',
        '铱合金火星塞', '特斯拉线圈'
      ]
    },
    {
      name: '装备经验',
      factor: 16708,
      type: 'equipment',

      contents: [
        '灵魂碎片', '双子灵魂碎片',
        '灵魂结晶', '双子灵魂结晶',
        '以太碎片', '双子以太碎片',
        '以太结晶', '双子以太结晶',
      ]
    },
    {
      name: '还是钱',
      factor: 8354,
      type: 'equipment',
      contents: [
        '吼里宝藏', '吼美宝藏', '吼咪宝藏'
      ]
    },
  ]
};

