export const equipmentLevel = {
  1: [
    '基础学习芯片',
    '灵魂碎片',
    '以太碎片',
    '崩坏兽拳甲',
    '崩坏兽翅壳',
    '大剑的破刃',
    '吼喔宝藏',
  ],
  2: [
    '进阶学习芯片',
    '双子灵魂碎片',
    '双子以太碎片',
    '钛合金枪管',
    '钨合金胸甲',
    '浮空装甲',
    '吼辣宝藏',
    '初级技能材料'
  ],
  3: [
    '高级生物芯片',
    '高级机械芯片',
    '高级异能芯片',
    '灵魂结晶',
    '以太结晶',
    '断裂的刀柄',
    '超小型反应炉',
    '铱合金火星塞',
    '吼姆宝藏',
    '吼里宝藏',
  ],
  4: [
    '特级生物芯片',
    '特级机械芯片',
    '特级异能芯片',
    '双子灵魂结晶',
    '双子以太结晶',
    '超合金反射镜',
    '特斯拉线圈',
    '超合金护盾',
    '吼美宝藏',
    '吼咪宝藏',
    '高级技能材料'
  ]
};
