export const stigmataLevel = {
  1: [
  ],
  2: [
    '汉娜',
    '奥托薇拉',
    '露西亚',
    '薇欧拉',
    '维多利亚',
    '依莲娜',
    '夏洛特',
  ],
  3: [
    '伊丽莎白',
    '王昭君',
    '阿提拉',
    '坂本龙马',
    '特斯拉',
    '大帝',
    '奥吉尔',
    '时雨绮罗',
    '里纳耳多',
    '女武神犹大'
  ],
  4: [
    '埃及艳后',
    '开普勒',
    '长光',
    '德古拉',
    '板鸭黯影',
    '杏',
    '奥托',
    '卡莲颂歌',
    '绯玉丸',
    '西琳',
    '米开朗其罗',
    '爱因斯坦乐队',
    '特斯拉乐队',
    '薛定谔乐队',
    '姬轩辕',
    '莎士比亚',
    '俄国沙皇',
    '李耳',
    '伏羲',
    '女娲',
    '神农',
    '牛顿',
    '薛定谔',
    '普朗克',
    '李耳红',
    '卡莲誓约',
    '真田辛村',
    '岳父',
    '岳母',
    '浓姬',
    '莫奈',
    '伽利略',
    '丹朱·人偶师'
  ]
};




