export const equipment = {
  '基础学习芯片': '1001',
  '进阶学习芯片': '1002',
  '高级生物芯片': '1003',
  '高级机械芯片': '1004',
  '高级异能芯片': '1005',
  '特级生物芯片': '1006',
  '特级机械芯片': '1007',
  '特级异能芯片': '1008',
  //
  '灵魂碎片': '3005',
  '双子灵魂碎片': '3006',
  '灵魂结晶': '3007',
  '双子灵魂结晶': '3008',
  //
  '以太碎片': '3001',
  '双子以太碎片': '3002',
  '以太结晶': '3003',
  '双子以太结晶': '3004',
  //
  '崩坏兽拳甲': '4004',
  '崩坏兽翅壳': '4006',
  '大剑的破刃': '4001',
  '钛合金枪管': '4002',
  '钨合金胸甲': '4009',
  '浮空装甲': '4010',
  //
  '超合金护盾': '4004',
  '断裂的刀柄': '4003',
  '超小型反应炉': '4007',
  '超合金反射镜': '4008',
  '铱合金火星塞': '4011',
  '特斯拉线圈': '4012',
  //
  '吼喔宝藏': '7022',
  '吼辣宝藏': '7023',
  '吼姆宝藏': '7024',
  '吼里宝藏': '7025',
  '吼美宝藏': '7026',
  '吼咪宝藏': '7027',

};
